[
  {
    "palabra": "Algoritmo",
    "traduccion": "algorithm",
    "categoria": "programacion",
    "definicion": "Conjunto ordenado de pasos que resuelven un problema o realizan una tarea.",
    "ejemplo": "El algoritmo de ordenamiento organiza los datos de menor a mayor."
  },
  {
    "palabra": "Abrir",
    "traduccion": "Open",
    "categoria": "informatica",
    "definicion": "Acción de iniciar o acceder a un archivo, carpeta o aplicación en un sistema informático.",
    "ejemplo": "Para editar el documento, primero debés abrir el archivo desde el menú principal."
  },
  {
    "palabra": "Acerca",
    "traduccion": "About",
    "categoria": "informatica",
    "definicion": "Sección de una aplicación o sitio web que brinda información sobre el software, su versión y sus autores.",
    "ejemplo": "En el menú 'Ayuda', seleccioná 'Acerca' para ver la versión del programa."
  },
  {
    "palabra": "Aplicación",
    "traduccion": "Application",
    "categoria": "informatica",
    "definicion": "Programa diseñado para realizar tareas específicas en una computadora o dispositivo móvil.",
    "ejemplo": "La aplicación de mensajería permite enviar textos y archivos en tiempo real."
  },
  {
    "palabra": "Aplicaciones",
    "traduccion": "Applications",
    "categoria": "informatica",
    "definicion": "Conjunto de programas que permiten al usuario realizar diversas tareas en un entorno digital.",
    "ejemplo": "Las aplicaciones de edición de imagen permiten retocar fotografías fácilmente."
  },
  {
    "palabra": "Arranque",
    "traduccion": "Boot",
    "categoria": "informatica",
    "definicion": "Proceso inicial mediante el cual un sistema operativo se carga en la memoria al encender el dispositivo.",
    "ejemplo": "El arranque del sistema puede tardar más si hay muchas aplicaciones configuradas para iniciar automáticamente."
  },
  {
    "palabra": "Ataque",
    "traduccion": "Attack",
    "categoria": "informatica",
    "definicion": "Intento malicioso de acceder, dañar o interrumpir sistemas informáticos o redes.",
    "ejemplo": "El firewall bloqueó un ataque de tipo phishing proveniente de un sitio sospechoso."
  },
  {
    "palabra": "Batería",
    "traduccion": "Battery",
    "categoria": "informatica",
    "definicion": "Dispositivo que almacena energía eléctrica para alimentar equipos portátiles como laptops o teléfonos.",
    "ejemplo": "La batería del celular se agotó después de varias horas de uso intensivo."
  },
  {
    "palabra": "Bit",
    "traduccion": "Bit",
    "categoria": "informatica",
    "definicion": "Unidad mínima de información digital, que puede tener un valor de 0 o 1.",
    "ejemplo": "Un byte está compuesto por ocho bits."
  },
  {
    "palabra": "Borrar",
    "traduccion": "Delete",
    "categoria": "informatica",
    "definicion": "Acción de eliminar archivos, datos o elementos digitales de un sistema.",
    "ejemplo": "Antes de liberar espacio, es importante revisar qué archivos se van a borrar."
  },
  {
    "palabra": "Byte",
    "traduccion": "Byte",
    "categoria": "informatica",
    "definicion": "Unidad de información digital compuesta por 8 bits.",
    "ejemplo": "Un archivo de texto simple puede ocupar solo unos pocos bytes."
  },
  {
    "palabra": "Caché",
    "traduccion": "Cache",
    "categoria": "informatica",
    "definicion": "Memoria de acceso rápido que almacena datos temporales para acelerar procesos.",
    "ejemplo": "El navegador guarda imágenes en la caché para cargar más rápido las páginas visitadas."
  },
  {
    "palabra": "Carpeta",
    "traduccion": "Folder",
    "categoria": "informatica",
    "definicion": "Contenedor digital que organiza archivos en un sistema informático.",
    "ejemplo": "Guardá tus documentos en la carpeta 'Proyectos' para tenerlos ordenados."
  },
  {
    "palabra": "Cartel",
    "traduccion": "Popup / Message box",
    "categoria": "informatica",
    "definicion": "Ventana o mensaje emergente que informa al usuario sobre una acción o error.",
    "ejemplo": "El sistema mostró un cartel indicando que el archivo fue guardado correctamente."
  },
  {
    "palabra": "Cerrar",
    "traduccion": "Close",
    "categoria": "informatica",
    "definicion": "Acción de finalizar o salir de una aplicación, archivo o ventana.",
    "ejemplo": "Recordá cerrar todas las aplicaciones antes de apagar la computadora."
  },
  {
    "palabra": "Chocar",
    "traduccion": "Crash",
    "categoria": "informatica",
    "definicion": "Fallo repentino de un programa o sistema que interrumpe su funcionamiento.",
    "ejemplo": "La aplicación chocó al intentar abrir un archivo corrupto."
  },
  {
    "palabra": "Ciberseguridad",
    "traduccion": "Cybersecurity",
    "categoria": "informatica",
    "definicion": "Conjunto de prácticas y tecnologías destinadas a proteger sistemas informáticos y datos digitales frente a accesos no autorizados o ataques.",
    "ejemplo": "La ciberseguridad es clave para evitar el robo de información personal en línea."
  },
  {
    "palabra": "Clase",
    "traduccion": "Class",
    "categoria": "informatica",
    "definicion": "Estructura en programación orientada a objetos que define propiedades y comportamientos de un tipo de objeto.",
    "ejemplo": "La clase 'Usuario' contiene atributos como nombre y correo electrónico."
  },
  {
    "palabra": "Clic",
    "traduccion": "Click",
    "categoria": "informatica",
    "definicion": "Acción de presionar un botón del mouse o dispositivo táctil para interactuar con una interfaz digital.",
    "ejemplo": "Hacé clic en el ícono para abrir la aplicación."
  },
  {
    "palabra": "Código",
    "traduccion": "Code",
    "categoria": "informatica",
    "definicion": "Conjunto de instrucciones escritas en un lenguaje de programación que indican a la computadora qué hacer.",
    "ejemplo": "El código de la página web define su estructura y comportamiento."
  },
  {
    "palabra": "Código fuente",
    "traduccion": "Source code",
    "categoria": "informatica",
    "definicion": "Versión original del código escrito por el programador antes de ser compilado o ejecutado.",
    "ejemplo": "El código fuente del programa está disponible en GitHub para su revisión."
  },
  {
    "palabra": "Computadora",
    "traduccion": "Computer",
    "categoria": "informatica",
    "definicion": "Dispositivo electrónico que procesa información mediante programas y permite realizar múltiples tareas digitales.",
    "ejemplo": "La computadora se utiliza para escribir documentos, navegar por internet y editar imágenes."
  },
  {
    "palabra": "Con",
    "traduccion": "With",
    "categoria": "programacion",
    "definicion": "Preposición utilizada en interfaces y comandos para indicar asociación o acompañamiento entre elementos.",
    "ejemplo": "Abrí el archivo con el editor de texto predeterminado."
  },
  {
    "palabra": "Conexión",
    "traduccion": "Connection",
    "categoria": "informatica",
    "definicion": "Enlace entre dispositivos o sistemas que permite el intercambio de datos.",
    "ejemplo": "La conexión a internet se interrumpió durante la videollamada."
  },
  {
    "palabra": "Consola",
    "traduccion": "Console",
    "categoria": "informatica",
    "definicion": "Interfaz de texto utilizada para ejecutar comandos y controlar sistemas informáticos.",
    "ejemplo": "Ingresá el comando en la consola para compilar el programa."
  },
  {
    "palabra": "Control",
    "traduccion": "Control",
    "categoria": "informatica",
    "definicion": "Elemento o función que permite gestionar el comportamiento de un sistema o aplicación.",
    "ejemplo": "El panel de control permite ajustar la configuración del sistema operativo."
  },
  {
    "palabra": "Copia de seguridad",
    "traduccion": "Backup",
    "categoria": "informatica",
    "definicion": "Duplicado de archivos o datos que se guarda para prevenir pérdidas en caso de fallos.",
    "ejemplo": "Es recomendable hacer una copia de seguridad antes de actualizar el sistema."
  },
  {
    "palabra": "Copias",
    "traduccion": "Copies",
    "categoria": "informatica",
    "definicion": "Reproducciones exactas de archivos, documentos o datos digitales.",
    "ejemplo": "Guardá varias copias del informe en diferentes dispositivos por seguridad."
  },
  {
    "palabra": "Correo electrónico",
    "traduccion": "Email",
    "categoria": "informatica",
    "definicion": "Sistema digital que permite enviar y recibir mensajes a través de redes informáticas.",
    "ejemplo": "Recibí el contrato por correo electrónico y lo reenvié al equipo."
  },
  {
    "palabra": "CPU",
    "traduccion": "Central Processing Unit",
    "categoria": "arquitectura",
    "definicion": "Unidad central de procesamiento que ejecuta instrucciones y coordina las operaciones de un sistema informático.",
    "ejemplo": "La CPU interpreta el código y realiza cálculos para que el programa funcione."
  },
  {
    "palabra": "Cursor",
    "traduccion": "Cursor",
    "categoria": "arquitectura",
    "definicion": "Indicador visual que señala la posición activa en una interfaz, generalmente en un campo de texto o en la pantalla.",
    "ejemplo": "El cursor parpadea en el lugar donde se insertará el próximo carácter."
  },
  {
    "palabra": "Datos",
    "traduccion": "Data",
    "categoria": "informatica",
    "definicion": "Información codificada que puede ser procesada, almacenada o transmitida por sistemas digitales.",
    "ejemplo": "Los datos del usuario se guardan en una base cifrada para mayor seguridad."
  },
  {
    "palabra": "Desarrollador",
    "traduccion": "Developer",
    "categoria": "programacion",
    "definicion": "Persona que diseña, construye y mantiene software o sistemas digitales.",
    "ejemplo": "El desarrollador creó una aplicación que traduce términos técnicos al lenguaje cotidiano."
  },
  {
    "palabra": "Descarga",
    "traduccion": "Download",
    "categoria": "informatica",
    "definicion": "Proceso de transferencia de archivos desde un servidor remoto al dispositivo local.",
    "ejemplo": "La descarga del paquete de instalación tardó menos de un minuto."
  },
  {
    "palabra": "Después",
    "traduccion": "After",
    "categoria": "programacion",
    "definicion": "Referencia temporal que indica una acción o evento posterior en una secuencia digital o lógica.",
    "ejemplo": "Después de instalar el programa, reiniciá la computadora para aplicar los cambios."
  },
  {
    "palabra": "Dirección IP",
    "traduccion": "IP Address",
    "categoria": "informatica",
    "definicion": "Identificador numérico único asignado a cada dispositivo conectado a una red informática.",
    "ejemplo": "La dirección IP permite localizar y comunicar tu computadora dentro de la red."
  },
  {
    "palabra": "Disco duro",
    "traduccion": "Hard drive",
    "categoria": "arquitectura",
    "definicion": "Dispositivo de almacenamiento permanente que guarda datos y programas en una computadora.",
    "ejemplo": "El disco duro tiene una capacidad de 1 TB para guardar archivos y aplicaciones."
  },
  {
    "palabra": "Dispositivo",
    "traduccion": "Device",
    "categoria": "informatica",
    "definicion": "Elemento físico o electrónico que cumple una función específica dentro de un sistema informático.",
    "ejemplo": "El teclado es un dispositivo de entrada que permite escribir en la computadora."
  },
  {
    "palabra": "Dominio",
    "traduccion": "Domain",
    "categoria": "informatica",
    "definicion": "Nombre único que identifica un sitio web en internet, asociado a una dirección IP.",
    "ejemplo": "El dominio del sitio institucional es www.tsds.edu.ar."
  },
  {
    "palabra": "Eficiente",
    "traduccion": "Efficient",
    "categoria": "informatica",
    "definicion": "Que realiza tareas con el menor uso posible de recursos como tiempo, memoria o energía.",
    "ejemplo": "El nuevo algoritmo es más eficiente y reduce el tiempo de procesamiento."
  },
  {
    "palabra": "Ejecutar",
    "traduccion": "Run",
    "categoria": "programacion",
    "definicion": "Iniciar un programa o proceso para que comience a funcionar en un sistema.",
    "ejemplo": "Para ver el resultado, debés ejecutar el archivo principal del proyecto."
  },
  {
    "palabra": "Enlace",
    "traduccion": "Link",
    "categoria": "informatica",
    "definicion": "Referencia que conecta un documento o recurso digital con otro, permitiendo la navegación entre ellos.",
    "ejemplo": "Hacé clic en el enlace para acceder al formulario de inscripción."
  },
  {
    "palabra": "Enrutador / Router",
    "traduccion": "Router",
    "categoria": "informatica",
    "definicion": "Dispositivo que dirige el tráfico de datos entre redes, permitiendo la conexión a internet.",
    "ejemplo": "El enrutador distribuye la señal de internet a todos los dispositivos del hogar."
  },
  {
    "palabra": "Error",
    "traduccion": "Error",
    "categoria": "programacion",
    "definicion": "Condición inesperada que interrumpe o altera el funcionamiento normal de un programa.",
    "ejemplo": "El programa mostró un error al intentar acceder a un archivo inexistente."
  },
  {
    "palabra": "Escribir",
    "traduccion": "Write",
    "categoria": "programacion",
    "definicion": "Acción de registrar datos en un archivo, variable o consola dentro de un entorno de programación.",
    "ejemplo": "El script escribe los resultados en un archivo de texto."
  },
  {
    "palabra": "Escritorio",
    "traduccion": "Desktop",
    "categoria": "programacion",
    "definicion": "Entorno gráfico principal de un sistema operativo donde se organizan accesos y ventanas.",
    "ejemplo": "Guardá el archivo en el escritorio para acceder rápidamente."
  },
  {
    "palabra": "Esperar",
    "traduccion": "Wait",
    "categoria": "programacion",
    "definicion": "Instrucción que pausa la ejecución de un programa por un tiempo determinado o hasta que ocurra una condición.",
    "ejemplo": "La función espera 3 segundos antes de continuar con el siguiente paso."
  },
  {
    "palabra": "Estructura",
    "traduccion": "Structure",
    "categoria": "programacion",
    "definicion": "Organización lógica de datos o código que permite su manipulación eficiente dentro de un programa.",
    "ejemplo": "La estructura de datos tipo lista permite almacenar elementos en orden secuencial."
  },
  {
    "palabra": "Etiqueta (HTML)",
    "traduccion": "HTML Tag",
    "categoria": "informatica",
    "definicion": "Elemento del lenguaje HTML que define la estructura y el contenido de una página web.",
    "ejemplo": "La etiqueta <p> se utiliza para definir un párrafo en HTML."
  },
  {
    "palabra": "Firewall (Cortafuegos)",
    "traduccion": "Firewall",
    "categoria": "informatica",
    "definicion": "Sistema de seguridad que controla el tráfico de red y bloquea accesos no autorizados.",
    "ejemplo": "El firewall impidió que un programa desconocido accediera a internet."
  },
  {
    "palabra": "Fuente",
    "traduccion": "Font / Source",
    "categoria": "informatica",
    "definicion": "Estilo tipográfico utilizado en textos digitales, o también el origen de un dato o recurso.",
    "ejemplo": "La fuente del texto puede cambiarse desde el menú de formato."
  },
  {
    "palabra": "Soporte fisico",
    "traduccion": "Hardware",
    "categoria": "informatica",
    "definicion": "Conjunto de componentes físicos que conforman un sistema informático.",
    "ejemplo": "El teclado, el monitor y el disco duro son parte del hardware de la computadora."
  },
  {
    "palabra": "Hecho",
    "traduccion": "Fact",
    "categoria": "programacion",
    "definicion": "Dato verificado que puede ser utilizado como base para análisis o decisiones digitales.",
    "ejemplo": "El sistema registra cada hecho relevante en el historial de actividad."
  },
  {
    "palabra": "Herramienta",
    "traduccion": "Tool",
    "categoria": "programacion",
    "definicion": "Programa o función que facilita la realización de tareas específicas en un entorno digital.",
    "ejemplo": "Photoshop es una herramienta para editar imágenes de forma profesional."
  },
  {
    "palabra": "Hipertexto",
    "traduccion": "Hypertext",
    "categoria": "informatica",
    "definicion": "Sistema de organización de información que permite navegar entre contenidos mediante enlaces.",
    "ejemplo": "El hipertexto transforma la lectura lineal en una experiencia interactiva."
  },
  {
    "palabra": "Imagen",
    "traduccion": "Image",
    "categoria": "informatica",
    "definicion": "Representación visual digital que puede ser almacenada, editada o mostrada en una pantalla.",
    "ejemplo": "La imagen del logo se guarda en formato PNG."
  },
  {
    "palabra": "Impacto",
    "traduccion": "Impact",
    "categoria": "programacion",
    "definicion": "Efecto o consecuencia que produce una acción digital en el sistema o en el usuario.",
    "ejemplo": "El impacto del nuevo diseño mejoró la experiencia de navegación."
  },
  {
    "palabra": "Iniciar",
    "traduccion": "Start",
    "categoria": "programacion",
    "definicion": "Acción de comenzar un proceso, programa o sesión en un entorno digital.",
    "ejemplo": "Para iniciar el sistema, presioná el botón de encendido."
  },
  {
    "palabra": "Instalar",
    "traduccion": "Install",
    "categoria": "informatica",
    "definicion": "Proceso de incorporar un programa o componente en el sistema para que pueda ser utilizado.",
    "ejemplo": "Instalá el software siguiendo los pasos del asistente de instalación."
  },
  {
    "palabra": "Internet",
    "traduccion": "Internet",
    "categoria": "informatica",
    "definicion": "Red global de computadoras interconectadas que permite el intercambio de información y servicios.",
    "ejemplo": "Gracias a internet, podemos acceder a recursos educativos desde cualquier lugar."
  },
  {
    "palabra": "Investigar",
    "traduccion": "Research",
    "categoria": "informatica",
    "definicion": "Proceso de búsqueda y análisis de información digital para comprender, resolver o crear algo nuevo.",
    "ejemplo": "Antes de diseñar el sitio, investigamos las mejores prácticas de accesibilidad."
  },
  {
    "palabra": "Periférico",
    "traduccion": "peripheral",
    "categoria": "arquitectura",
    "definicion": "Dispositivo externo que se conecta a la computadora para ampliar sus funciones.",
    "ejemplo": "El mouse es un periférico de entrada que traduce el movimiento en coordenadas digitales."
  },
  {
    "palabra": "Almacenamiento",
    "traduccion": "storage",
    "categoria": "informatica",
    "definicion": "Espacio físico o virtual donde se guardan datos de forma permanente o temporal.",
    "ejemplo": "Un disco sólido ofrece almacenamiento rápido y silencioso."
  },
  {
    "palabra": "Archivo",
    "traduccion": "file",
    "categoria": "informatica",
    "definicion": "Unidad de información digital que contiene datos estructurados o no estructurados.",
    "ejemplo": "El archivo 'informe.pdf' guarda el trabajo final del estudiante."
  },
  {
    "palabra": "Interfaz de usuario",
    "traduccion": "user interface",
    "categoria": "informatica",
    "definicion": "Conjunto de elementos visuales y funcionales que permiten la interacción con el sistema.",
    "ejemplo": "Los íconos y menús forman parte de la interfaz de usuario."
  },
  {
    "palabra": "Actualización",
    "traduccion": "update",
    "categoria": "informatica",
    "definicion": "Proceso de mejora o corrección de software mediante nuevas versiones.",
    "ejemplo": "La actualización incluye parches de seguridad y mejoras de rendimiento."
  },
  {
    "palabra": "Virus informático",
    "traduccion": "computer virus",
    "categoria": "informatica",
    "definicion": "Programa malicioso que altera el funcionamiento del sistema sin consentimiento.",
    "ejemplo": "El virus se propagó por correo electrónico y afectó varios equipos."
  },
  {
    "palabra": "Entorno virtual",
    "traduccion": "virtual environment",
    "categoria": "informatica",
    "definicion": "Espacio simulado que permite ejecutar procesos aislados del sistema principal.",
    "ejemplo": "Creamos un entorno virtual para probar el programa sin afectar el sistema real."
  },
  {
    "palabra": "Sistema operativo",
    "traduccion": "operating system",
    "categoria": "informatica",
    "definicion": "Software que gestiona los recursos del hardware y permite la interacción con el usuario.",
    "ejemplo": "Windows 11 es un sistema operativo con interfaz gráfica y multitarea."
  },
  {
    "palabra": "Software",
    "traduccion": "software",
    "categoria": "informatica",
    "definicion": "Conjunto de programas y rutinas que permiten realizar tareas en una computadora.",
    "ejemplo": "Photoshop es un software de edición de imágenes."
  },
  {
    "palabra": "Red informatica",
    "traduccion": "computer network",
    "categoria": "informatica",
    "definicion": "Conjunto de dispositivos conectados para compartir información y recursos.",
    "ejemplo": "Una red doméstica permite conectar computadoras, impresoras y teléfonos."
  },
  {
    "palabra": "Base de datos",
    "traduccion": "database",
    "categoria": "informatica",
    "definicion": "Sistema organizado para almacenar, gestionar y recuperar información.",
    "ejemplo": "MySQL es un gestor de bases de datos relacional."
  },
  {
    "palabra": "Interfaz gráfica",
    "traduccion": "graphical interface",
    "categoria": "informatica",
    "definicion": "Sistema visual que permite al usuario interactuar con el software mediante íconos y ventanas.",
    "ejemplo": "El escritorio de Windows es una interfaz gráfica amigable."
  },
  {
    "palabra": "Seguridad informática",
    "traduccion": "cybersecurity",
    "categoria": "informatica",
    "definicion": "Conjunto de prácticas y tecnologías para proteger sistemas y datos digitales.",
    "ejemplo": "Usar contraseñas seguras es parte de la seguridad informática."
  },
  {
    "palabra": "Resistencia",
    "traduccion": "resistor",
    "categoria": "arquitectura",
    "definicion": "Componente que limita el flujo de corriente eléctrica.",
    "ejemplo": "La resistencia de 220 ohm se usa para proteger el LED."
  },
  {
    "palabra": "Masa",
    "traduccion": "ground",
    "categoria": "arquitectura",
    "definicion": "Referencia de voltaje cero en un circuito.",
    "ejemplo": "Conectá el negativo del capacitor a masa."
  },
  {
    "palabra": "Memoria caché",
    "traduccion": "cache memory",
    "categoria": "arquitectura",
    "definicion": "Memoria rápida que almacena datos temporales para acelerar el acceso del procesador.",
    "ejemplo": "La caché guarda instrucciones que se usan con frecuencia para mejorar el rendimiento."
  },
  {
    "palabra": "Registro",
    "traduccion": "register",
    "categoria": "arquitectura",
    "definicion": "Pequeña unidad de almacenamiento dentro del procesador que guarda datos temporales.",
    "ejemplo": "El registro almacena el resultado de una operación aritmética antes de enviarlo a la memoria."
  },
  {
    "palabra": "Unidad de control",
    "traduccion": "control unit",
    "categoria": "arquitectura",
    "definicion": "Parte de la CPU que dirige el flujo de datos y coordina las operaciones internas.",
    "ejemplo": "La unidad de control decide qué instrucciones ejecutar y en qué orden."
  },
  {
    "palabra": "Unidad aritmético lógica",
    "traduccion": "arithmetic logic unit",
    "categoria": "arquitectura",
    "definicion": "Componente de la CPU que realiza operaciones matemáticas y lógicas.",
    "ejemplo": "La ALU calcula sumas, comparaciones y operaciones booleanas."
  },
  {
    "palabra": "Frecuencia de reloj",
    "traduccion": "clock frequency",
    "categoria": "arquitectura",
    "definicion": "Velocidad con la que el procesador ejecuta instrucciones, medida en hertz.",
    "ejemplo": "Un procesador de 3.2 GHz realiza 3.200 millones de ciclos por segundo."
  },
  {
    "palabra": "Multinúcleo",
    "traduccion": "multicore",
    "categoria": "arquitectura",
    "definicion": "Procesador que contiene dos o más núcleos independientes para ejecutar tareas en paralelo.",
    "ejemplo": "Un CPU multinúcleo permite ejecutar varios procesos simultáneamente."
  },
  {
    "palabra": "Energía eléctrica",
    "traduccion": "electrical energy",
    "categoria": "arquitectura",
    "definicion": "Forma de energía que alimenta los componentes electrónicos de una computadora.",
    "ejemplo": "La energía eléctrica fluye desde la fuente de alimentación hacia la placa madre."
  },
  {
    "palabra": "Corriente continua",
    "traduccion": "direct current",
    "categoria": "arquitectura",
    "definicion": "Tipo de corriente eléctrica que fluye en una sola dirección, utilizada en circuitos digitales.",
    "ejemplo": "Los componentes internos del CPU funcionan con corriente continua."
  },
  {
    "palabra": "Voltaje",
    "traduccion": "voltage",
    "categoria": "arquitectura",
    "definicion": "Diferencia de potencial eléctrico que impulsa el flujo de corriente en un circuito.",
    "ejemplo": "El procesador requiere un voltaje específico para operar de forma estable."
  },
  {
    "palabra": "Potencia eléctrica",
    "traduccion": "electric power",
    "categoria": "arquitectura",
    "definicion": "Cantidad de energía consumida por unidad de tiempo, medida en vatios.",
    "ejemplo": "Una fuente de 500W puede alimentar varios componentes simultáneamente."
  },
  {
    "palabra": "Resistencia eléctrica",
    "traduccion": "electrical resistance",
    "categoria": "arquitectura",
    "definicion": "Oposición al flujo de corriente en un material, que genera pérdida de energía en forma de calor.",
    "ejemplo": "Los cables con alta resistencia pueden provocar sobrecalentamiento."
  },
  {
    "palabra": "Eficiencia térmica",
    "traduccion": "thermal efficiency",
    "categoria": "arquitectura",
    "definicion": "Capacidad de un sistema para disipar el calor generado por el consumo energético.",
    "ejemplo": "Los disipadores mejoran la eficiencia térmica del procesador."
  },
  {
    "palabra": "Fuente de alimentación",
    "traduccion": "power supply",
    "categoria": "arquitectura",
    "definicion": "Dispositivo que convierte la corriente alterna en corriente continua para alimentar los componentes.",
    "ejemplo": "La fuente ATX entrega voltajes regulados a la placa madre y periféricos."
  },
  {
    "palabra": "Circuito eléctrico",
    "traduccion": "electric circuit",
    "categoria": "arquitectura",
    "definicion": "Camino cerrado por el que circula la corriente eléctrica para alimentar dispositivos.",
    "ejemplo": "El circuito de la placa madre distribuye energía a cada componente."
  },
  {
    "palabra": "Calor residual",
    "traduccion": "residual heat",
    "categoria": "arquitectura",
    "definicion": "Energía térmica no aprovechada que se libera durante el funcionamiento de los componentes.",
    "ejemplo": "El calor residual del CPU se disipa mediante ventiladores y pasta térmica."
  },
  {
    "palabra": "Rendimiento energético",
    "traduccion": "energy performance",
    "categoria": "arquitectura",
    "definicion": "Relación entre la energía consumida y la capacidad de procesamiento obtenida.",
    "ejemplo": "Un sistema con buen rendimiento energético logra más con menos consumo."
  },
  {
    "palabra": "Función",
    "traduccion": "function",
    "categoria": "programacion",
    "definicion": "Bloque de código que realiza una tarea específica y puede ser reutilizado.",
    "ejemplo": "function saludar() { console.log('Hola'); }"
  },
  {
    "palabra": "Condición",
    "traduccion": "condition",
    "categoria": "programacion",
    "definicion": "Expresión que se evalúa como verdadera o falsa para controlar el flujo del programa.",
    "ejemplo": "if (edad > 18) { console.log('Mayor de edad'); }"
  },
  {
    "palabra": "Objeto",
    "traduccion": "object",
    "categoria": "programacion",
    "definicion": "Entidad que agrupa propiedades y métodos relacionados.",
    "ejemplo": "let persona = { nombre: 'Ana', edad: 30 };"
  },
  {
    "palabra": "Array",
    "traduccion": "array",
    "categoria": "programacion",
    "definicion": "Colección ordenada de elementos que se acceden por índice.",
    "ejemplo": "let frutas = ['manzana', 'banana', 'pera'];"
  },
  {
    "palabra": "Clase",
    "traduccion": "class",
    "categoria": "programacion",
    "definicion": "Plantilla para crear objetos con propiedades y métodos definidos.",
    "ejemplo": "class Animal { constructor(nombre) { this.nombre = nombre; } }"
  },
  {
    "palabra": "Interfaz",
    "traduccion": "interface",
    "categoria": "programacion",
    "definicion": "Contrato que define qué métodos y propiedades debe tener una clase.",
    "ejemplo": "interface Vehiculo { encender(): void; }"
  },
  {
    "palabra": "Compilador",
    "traduccion": "compiler",
    "categoria": "programacion",
    "definicion": "Programa que traduce código fuente a lenguaje máquina.",
    "ejemplo": "El compilador convierte el código C++ en ejecutable."
  },
  {
    "palabra": "Depuración",
    "traduccion": "debugging",
    "categoria": "programacion",
    "definicion": "Proceso de identificar y corregir errores en el código fuente.",
    "ejemplo": "Usamos la consola para depurar el comportamiento inesperado del programa."
  },
  {
    "palabra": "Compilación",
    "traduccion": "compilation",
    "categoria": "programacion",
    "definicion": "Transformación del código fuente en un archivo ejecutable por la máquina.",
    "ejemplo": "El compilador traduce el código C++ a lenguaje máquina."
  },
  {
    "palabra": "Lenguaje de programación",
    "traduccion": "programming language",
    "categoria": "programacion",
    "definicion": "Sistema de escritura estructurada que permite crear instrucciones para una computadora.",
    "ejemplo": "Python es un lenguaje de programación interpretado y de alto nivel."
  },
  {
    "palabra": "Comentario",
    "traduccion": "comment",
    "categoria": "programacion",
    "definicion": "Texto dentro del código que explica su funcionamiento sin afectar la ejecución.",
    "ejemplo": "// Este comentario describe la función que sigue."
  },
  {
    "palabra": "Identación",
    "traduccion": "indentation",
    "categoria": "programacion",
    "definicion": "Espaciado visual que organiza el código y facilita su lectura.",
    "ejemplo": "La identación en Python es obligatoria para definir bloques de código."
  },
  {
    "palabra": "Recursividad",
    "traduccion": "recursion",
    "categoria": "programacion",
    "definicion": "Técnica en la que una función se llama a sí misma para resolver un problema.",
    "ejemplo": "La función factorial se puede resolver de forma recursiva."
  },
  {
    "palabra": "Parámetro",
    "traduccion": "parameter",
    "categoria": "programacion",
    "definicion": "Valor que se pasa a una función para personalizar su comportamiento.",
    "ejemplo": "La función saludar(nombre) recibe un parámetro llamado 'nombre'."
  },
  {
    "palabra": "Retorno",
    "traduccion": "return",
    "categoria": "programacion",
    "definicion": "Valor que una función entrega como resultado de su ejecución.",
    "ejemplo": "La función suma retorna el resultado de a + b."
  },
  {
    "palabra": "Estructura de control",
    "traduccion": "control structure",
    "categoria": "programacion",
    "definicion": "Instrucción que define el flujo de ejecución del programa.",
    "ejemplo": "El condicional if es una estructura de control que evalúa una condición."
  },
  {
    "palabra": "Biblioteca",
    "traduccion": "library",
    "categoria": "programacion",
    "definicion": "Conjunto de funciones y recursos reutilizables que se pueden incorporar al código.",
    "ejemplo": "La biblioteca 'math' permite realizar cálculos matemáticos avanzados."
  },
  {
    "palabra": "Asincronía",
    "traduccion": "asynchrony",
    "categoria": "programacion",
    "definicion": "Modelo de ejecución donde las tareas no se bloquean entre sí y pueden completarse en distintos momentos.",
    "ejemplo": "La función fetch opera de forma asíncrona para obtener datos sin detener el flujo del programa."
  },
  {
    "palabra": "Promesa",
    "traduccion": "promise",
    "categoria": "programacion",
    "definicion": "Objeto que representa el resultado futuro de una operación asincrónica.",
    "ejemplo": "fetch devuelve una promesa que se resuelve cuando llegan los datos."
  },
  {
    "palabra": "Llamar de vuelta",
    "traduccion": "callback",
    "categoria": "programacion",
    "definicion": "Función que se pasa como argumento a otra y se ejecuta después de completar una tarea.",
    "ejemplo": "setTimeout recibe un callback que se ejecuta tras un retraso."
  },
  {
    "palabra": "Programación orientada a objetos",
    "traduccion": "object-oriented programming",
    "categoria": "programacion",
    "definicion": "Paradigma que organiza el código en objetos que combinan datos y comportamientos.",
    "ejemplo": "Creamos una clase 'Vehículo' con propiedades y métodos para simular su funcionamiento."
  },
  {
    "palabra": "Herencia",
    "traduccion": "inheritance",
    "categoria": "programacion",
    "definicion": "Mecanismo que permite a una clase adquirir propiedades y métodos de otra.",
    "ejemplo": "La clase 'Auto' hereda de 'Vehículo' y agrega nuevas funciones."
  },
  {
    "palabra": "Encapsulamiento",
    "traduccion": "encapsulation",
    "categoria": "programacion",
    "definicion": "Principio que protege los datos internos de un objeto, permitiendo acceder solo mediante métodos definidos.",
    "ejemplo": "Usamos métodos get y set para controlar el acceso a las propiedades privadas."
  },
  {
    "palabra": "Polimorfismo",
    "traduccion": "polymorphism",
    "categoria": "programacion",
    "definicion": "Capacidad de diferentes objetos de responder a la misma acción de manera distinta.",
    "ejemplo": "El método 'mover()' se comporta diferente en 'Auto' y 'Avión'."
  },
  {
    "palabra": "Programación funcional",
    "traduccion": "functional programming",
    "categoria": "programacion",
    "definicion": "Paradigma que trata la computación como evaluación de funciones puras sin efectos secundarios.",
    "ejemplo": "Usamos map y filter para transformar listas sin modificar el estado original."
  },
  {
    "palabra": "Estado",
    "traduccion": "state",
    "categoria": "programacion",
    "definicion": "Conjunto de valores que describen la situación actual de un programa o componente.",
    "ejemplo": "El estado de una aplicación cambia cuando el usuario interactúa con la interfaz."
  },
  {
    "palabra": "Evento",
    "traduccion": "event",
    "categoria": "programacion",
    "definicion": "Acción que ocurre en el sistema y puede ser detectada para ejecutar una respuesta.",
    "ejemplo": "El evento 'click' activa una función que muestra un mensaje."
  },
  {
    "palabra": "Lista enlazada",
    "traduccion": "linked list",
    "categoria": "programacion",
    "definicion": "Estructura donde cada elemento apunta al siguiente, formando una cadena dinámica.",
    "ejemplo": "Cada nodo contiene un valor y una referencia al siguiente nodo."
  },
  {
    "palabra": "Pila",
    "traduccion": "stack",
    "categoria": "programacion",
    "definicion": "Colección de elementos con acceso tipo LIFO: el último en entrar es el primero en salir.",
    "ejemplo": "Usamos una pila para deshacer acciones en un editor de texto."
  },
  {
    "palabra": "Cola",
    "traduccion": "queue",
    "categoria": "programacion",
    "definicion": "Colección de elementos con acceso tipo FIFO: el primero en entrar es el primero en salir.",
    "ejemplo": "Una cola gestiona las tareas pendientes en un sistema operativo."
  },
  {
    "palabra": "Arbol binario",
    "traduccion": "binary tree",
    "categoria": "programacion",
    "definicion": "Estructura jerárquica donde cada nodo tiene como máximo dos hijos.",
    "ejemplo": "Un árbol binario permite organizar datos para búsquedas eficientes."
  },
  {
    "palabra": "Grafo",
    "traduccion": "graph",
    "categoria": "programacion",
    "definicion": "Conjunto de nodos conectados por aristas, útil para representar relaciones complejas.",
    "ejemplo": "Un grafo puede modelar redes sociales o rutas de transporte."
  },
  {
    "palabra": "Tabla hash",
    "traduccion": "hash table",
    "categoria": "programacion",
    "definicion": "Estructura que asocia claves con valores mediante una función de dispersión.",
    "ejemplo": "Una tabla hash permite acceder rápidamente a datos por su clave."
  },
  {
    "palabra": "Monton",
    "traduccion": "heap",
    "categoria": "programacion",
    "definicion": "Árbol especializado que mantiene el orden de prioridad entre sus elementos.",
    "ejemplo": "Un heap se usa para implementar colas de prioridad."
  },
  {
    "palabra": "Registro",
    "traduccion": "record",
    "categoria": "programacion",
    "definicion": "Conjunto de campos agrupados que representan una entidad con múltiples atributos.",
    "ejemplo": "Un registro de usuario puede tener nombre, edad y correo electrónico."
  },
  {
    "palabra": "Conjunto",
    "traduccion": "set",
    "categoria": "programacion",
    "definicion": "Colección de elementos únicos sin orden específico.",
    "ejemplo": "Un conjunto puede almacenar etiquetas sin repetir ninguna."
  },
  {
    "palabra": "Condicional",
    "traduccion": "conditional",
    "categoria": "programacion",
    "definicion": "Estructura que permite ejecutar acciones según se cumpla o no una condición.",
    "ejemplo": "Si la temperatura es mayor a 30, mostramos 'Hace calor'."
  },
  {
    "palabra": "Bucle",
    "traduccion": "loop",
    "categoria": "programacion",
    "definicion": "Estructura que repite una acción mientras se cumpla una condición.",
    "ejemplo": "El bucle while repite el código mientras la variable sea menor a 10."
  },
  {
    "palabra": "Variable",
    "traduccion": "variable",
    "categoria": "programacion",
    "definicion": "Espacio de memoria que almacena un valor que puede cambiar durante la ejecución.",
    "ejemplo": "Declaramos la variable 'edad' y le asignamos el valor 25."
  },
  {
    "palabra": "Operador lógico",
    "traduccion": "logical operator",
    "categoria": "programacion",
    "definicion": "Símbolo que permite combinar condiciones: AND, OR, NOT.",
    "ejemplo": "Si edad > 18 && país == 'Argentina', permitimos el acceso."
  },
  {
    "palabra": "Estructura secuencial",
    "traduccion": "sequential structure",
    "categoria": "programacion",
    "definicion": "Bloque de instrucciones que se ejecutan una tras otra, sin saltos.",
    "ejemplo": "Primero se calcula el total, luego se imprime el resultado."
  },
  {
    "palabra": "Estructura condicional",
    "traduccion": "conditional structure",
    "categoria": "programacion",
    "definicion": "Bloque que toma decisiones según el valor de una condición.",
    "ejemplo": "Si el usuario está logueado, mostramos su perfil; si no, mostramos el login."
  },
  {
    "palabra": "Estructura repetitiva",
    "traduccion": "iterative structure",
    "categoria": "programacion",
    "definicion": "Bloque que repite instrucciones mientras se cumpla una condición.",
    "ejemplo": "El for recorre cada elemento de la lista y lo imprime."
  },
  {
    "palabra": "Diagrama de flujo",
    "traduccion": "flowchart",
    "categoria": "programacion",
    "definicion": "Representación gráfica de un algoritmo usando símbolos conectados por flechas.",
    "ejemplo": "El diagrama de flujo muestra el camino lógico desde el inicio hasta el fin."
  },
  {
    "palabra": "Entrada",
    "traduccion": "input",
    "categoria": "programacion",
    "definicion": "Dato que el programa recibe para procesar.",
    "ejemplo": "Solicitamos al usuario que ingrese su nombre como entrada."
  },
  {
    "palabra": "Salida",
    "traduccion": "output",
    "categoria": "programacion",
    "definicion": "Resultado que el programa entrega tras procesar los datos.",
    "ejemplo": "La salida del programa es el mensaje 'Bienvenido, Efraín'."
  },
  {
    "palabra": "AND",
    "traduccion": "AND",
    "categoria": "programacion",
    "definicion": "Operador lógico que devuelve verdadero solo si ambas condiciones son verdaderas.",
    "ejemplo": "Si edad > 18 AND país == 'Argentina', se permite el acceso."
  },
  {
    "palabra": "OR",
    "traduccion": "OR",
    "categoria": "programacion",
    "definicion": "Operador lógico que devuelve verdadero si al menos una condición es verdadera.",
    "ejemplo": "Si usuario == 'admin' OR usuario == 'invitado', se muestra el panel."
  },
  {
    "palabra": "NOT",
    "traduccion": "NOT",
    "categoria": "programacion",
    "definicion": "Operador lógico que invierte el valor de verdad de una condición.",
    "ejemplo": "Si NOT conectado, mostramos el mensaje 'Sin conexión'."
  },
  {
    "palabra": "XOR",
    "traduccion": "XOR",
    "categoria": "programacion",
    "definicion": "Operador lógico exclusivo: devuelve verdadero si solo una condición es verdadera, pero no ambas.",
    "ejemplo": "Si A XOR B es verdadero, significa que solo uno de los dos es verdadero."
  },
  {
    "palabra": "Comparación",
    "traduccion": "comparison",
    "categoria": "programacion",
    "definicion": "Evaluación entre dos valores usando operadores como ==, !=, >, <, >=, <=.",
    "ejemplo": "Si temperatura >= 30, mostramos 'Hace calor'."
  },
  {
    "palabra": "Expresión lógica",
    "traduccion": "logical expression",
    "categoria": "programacion",
    "definicion": "Combinación de operadores y valores que devuelve un resultado booleano.",
    "ejemplo": "La expresión (a > b) AND (c != d) evalúa si ambas condiciones son verdaderas."
  },
  {
    "palabra": "Valor booleano",
    "traduccion": "boolean value",
    "categoria": "programacion",
    "definicion": "Tipo de dato que solo puede ser verdadero (true) o falso (false).",
    "ejemplo": "La variable 'activo' puede tener el valor booleano true o false."
  },
  {
    "palabra": "Tabla de verdad",
    "traduccion": "truth table",
    "categoria": "programacion",
    "definicion": "Representación de todos los posibles resultados de una expresión lógica.",
    "ejemplo": "La tabla de verdad de A AND B muestra que solo es verdadera cuando ambos son verdaderos."
  },
  {
    "palabra": "Evaluación corta",
    "traduccion": "short-circuit evaluation",
    "categoria": "programacion",
    "definicion": "Técnica donde se evita evaluar una segunda condición si la primera ya determina el resultado.",
    "ejemplo": "En A AND B, si A es falso, no se evalúa B."
  },
  {
    "palabra": "Software",
    "traduccion": "Software",
    "categoria": "programacion",
    "definicion": "Conjunto de programas y datos que permiten operar una computadora.",
    "ejemplo": "El software de edición permite modificar imágenes digitalmente."
  },
  {
    "palabra": "Marco de trabajo",
    "traduccion": "Framework",
    "categoria": "programacion",
    "definicion": "Estructura reutilizable que facilita el desarrollo de software.",
    "ejemplo": "React es un framework popular para construir interfaces web."
  },
  {
    "palabra": "SQL",
    "traduccion": "Lenguaje de consulta estructurado",
    "categoria": "programacion",
    "definicion": "Lenguaje para gestionar bases de datos relacionales.",
    "ejemplo": "Con SQL se puede extraer información de una tabla específica."
  },
  {
    "palabra": "NoSQL",
    "traduccion": "No relacional",
    "categoria": "programacion",
    "definicion": "Tipo de base de datos flexible para datos no estructurados.",
    "ejemplo": "MongoDB es una base de datos NoSQL muy utilizada en proyectos web."
  },
  {
    "palabra": "Frontend",
    "traduccion": "Interfaz de usuario",
    "categoria": "programacion",
    "definicion": "Parte visual de una aplicación con la que interactúa el usuario.",
    "ejemplo": "El frontend de la app incluye botones, menús y formularios."
  },
  {
    "palabra": "Backend",
    "traduccion": "Lógica del servidor",
    "categoria": "programacion",
    "definicion": "Parte interna de una aplicación que procesa datos y lógica.",
    "ejemplo": "El backend gestiona las solicitudes y conecta con la base de datos."
  },
  {
    "palabra": "Error",
    "traduccion": "Bug",
    "categoria": "programacion",
    "definicion": "Fallo o comportamiento inesperado en el código.",
    "ejemplo": "Un bug impedía que el formulario se enviara correctamente."
  },
  {
    "palabra": "Testing",
    "traduccion": "Pruebas",
    "categoria": "programacion",
    "definicion": "Evaluación del software para asegurar su correcto funcionamiento.",
    "ejemplo": "Las pruebas unitarias verifican que cada función funcione como se espera."
  },
  {
    "palabra": "Despliegue",
    "traduccion": "Deployment",
    "categoria": "programacion",
    "definicion": "Proceso de publicar una aplicación para que esté disponible al público.",
    "ejemplo": "El despliegue se realizó en un servidor de producción."
  },
  {
    "palabra": "Script",
    "traduccion": "Guion o script",
    "categoria": "programacion",
    "definicion": "Archivo de código que automatiza tareas o ejecuta instrucciones.",
    "ejemplo": "El script actualiza automáticamente los datos cada noche."
  },
  {
    "palabra": "React",
    "traduccion": "React",
    "categoria": "programacion",
    "definicion": "Biblioteca de JavaScript para construir interfaces de usuario.",
    "ejemplo": "React permite crear componentes reutilizables para la web."
  },
  {
    "palabra": "JavaScript",
    "traduccion": "JavaScript",
    "categoria": "programacion",
    "definicion": "Lenguaje de programación para desarrollo web interactivo.",
    "ejemplo": "JavaScript permite validar formularios sin recargar la página."
  },
  {
    "palabra": "Python",
    "traduccion": "Python",
    "categoria": "programacion",
    "definicion": "Lenguaje de programación versátil usado en ciencia de datos, IA y web.",
    "ejemplo": "Python se usa para crear modelos de inteligencia artificial."
  },
  {
    "palabra": "Java",
    "traduccion": "Java",
    "categoria": "programacion",
    "definicion": "Lenguaje de programación usado en aplicaciones empresariales y móviles.",
    "ejemplo": "La app de Android fue desarrollada en Java."
  },
  {
    "palabra": "C++",
    "traduccion": "C++",
    "categoria": "programacion",
    "definicion": "Lenguaje de programación de alto rendimiento para sistemas y videojuegos.",
    "ejemplo": "C++ se usa para desarrollar motores gráficos en videojuegos."
  },
  {
    "palabra": "Maquina",
    "categoria": "informatica",
    "traduccion": "Machine",
    "definicion": "Dispositivo que realiza tareas automáticamente mediante instrucciones programadas.",
    "ejemplo": "La máquina virtual permite ejecutar sistemas operativos dentro de otro sistema."
  },
  {
    "palabra": "Mas",
    "categoria": "programacion",
    "traduccion": "More",
    "definicion": "Operador o término que indica adición o ampliación en contextos informáticos.",
    "ejemplo": "Presioná el botón 'Más opciones' para ver funciones avanzadas."
  },
  {
    "palabra": "Mientras",
    "categoria": "programacion",
    "traduccion": "While",
    "definicion": "Palabra clave que define bucles condicionales en programación.",
    "ejemplo": "El bucle 'mientras' se ejecuta mientras la condición sea verdadera."
  },
  {
    "palabra": "Mostrar",
    "categoria": "programacion",
    "traduccion": "Display",
    "definicion": "Acción de presentar información en pantalla o interfaz.",
    "ejemplo": "El programa debe mostrar los resultados al finalizar el cálculo."
  },
  {
    "palabra": "Navegador",
    "categoria": "informatica",
    "traduccion": "Browser",
    "definicion": "Aplicación que permite acceder y visualizar sitios web en Internet.",
    "ejemplo": "Google Chrome es uno de los navegadores más utilizados."
  },
  {
    "palabra": "Negocio",
    "categoria": "informatica",
    "traduccion": "Business",
    "definicion": "Área o actividad comercial que puede ser gestionada mediante herramientas digitales.",
    "ejemplo": "El software de gestión ayuda a organizar los procesos del negocio."
  },
  {
    "palabra": "Nube",
    "categoria": "informatica",
    "traduccion": "Cloud",
    "definicion": "Sistema de almacenamiento y procesamiento de datos en servidores remotos accesibles por Internet.",
    "ejemplo": "Guardá tus archivos en la nube para acceder desde cualquier dispositivo."
  },
  {
    "palabra": "Pantalla",
    "categoria": "informatica",
    "traduccion": "Screen",
    "definicion": "Superficie de salida visual donde se muestran imágenes, texto y gráficos.",
    "ejemplo": "La pantalla táctil permite interactuar directamente con el dispositivo."
  },
  {
    "palabra": "Programa",
    "categoria": "informatica",
    "traduccion": "Program",
    "definicion": "Conjunto de instrucciones que una computadora ejecuta para realizar tareas específicas.",
    "ejemplo": "El programa de edición de imágenes permite retocar fotografías digitalmente."
  },
  {
    "palabra": "Raton",
    "categoria": "arquitectura",
    "traduccion": "Mouse",
    "definicion": "Dispositivo de entrada que permite interactuar con la interfaz gráfica de una computadora.",
    "ejemplo": "Mové el ratón para seleccionar el archivo que querés abrir."
  },
  {
    "palabra": "Red",
    "categoria": "informatica",
    "traduccion": "Network",
    "definicion": "Conjunto de dispositivos conectados entre sí para compartir información y recursos.",
    "ejemplo": "La red del instituto permite acceder a los servidores internos."
  },
  {
    "palabra": "Registros",
    "categoria": "informatica",
    "traduccion": "Logs",
    "definicion": "Archivos o entradas que documentan eventos, acciones o errores en un sistema.",
    "ejemplo": "Los registros del sistema muestran cuándo ocurrió el fallo."
  },
  {
    "palabra": "Reparar",
    "categoria": "programacion",
    "traduccion": "Repair",
    "definicion": "Acción de corregir fallos o restaurar el funcionamiento de un sistema o dispositivo.",
    "ejemplo": "Se necesita reparar el disco duro para recuperar los archivos."
  },
  {
    "palabra": "Seguir",
    "categoria": "informatica",
    "traduccion": "Follow",
    "definicion": "Acción de continuar un proceso, rastrear una cuenta o mantener una suscripción digital.",
    "ejemplo": "Podés seguir el canal para recibir actualizaciones del curso."
  },
  {
    "palabra": "Seguridad",
    "categoria": "informatica",
    "traduccion": "Security",
    "definicion": "Conjunto de medidas y prácticas que protegen los sistemas informáticos contra accesos no autorizados o daños.",
    "ejemplo": "La seguridad informática es clave para proteger los datos personales."
  },
  {
    "palabra": "Servicio",
    "categoria": "informatica",
    "traduccion": "Service",
    "definicion": "Funcionalidad o recurso ofrecido por un sistema o aplicación para cumplir tareas específicas.",
    "ejemplo": "El servicio de correo electrónico permite enviar y recibir mensajes."
  },
  {
    "palabra": "Servidor",
    "categoria": "informatica",
    "traduccion": "Server",
    "definicion": "Computadora o sistema que proporciona recursos, datos o servicios a otros dispositivos en una red.",
    "ejemplo": "El servidor aloja la base de datos del sitio web."
  },
  {
    "palabra": "Siguiente",
    "categoria": "programacion",
    "traduccion": "Next",
    "definicion": "Elemento que continúa en una secuencia o proceso digital.",
    "ejemplo": "Hacé clic en 'Siguiente' para continuar con la instalación."
  },
  {
    "palabra": "Sistema",
    "categoria": "informatica",
    "traduccion": "System",
    "definicion": "Conjunto de componentes que interactúan para cumplir funciones informáticas.",
    "ejemplo": "El sistema de gestión controla los procesos administrativos del instituto."
  },
  {
    "palabra": "Sitio Web",
    "categoria": "informatica",
    "traduccion": "Website",
    "definicion": "Conjunto de páginas digitales interconectadas que se acceden mediante un navegador.",
    "ejemplo": "El sitio web del diccionario técnico está alojado en GitHub Pages."
  },
  {
    "palabra": "Solución",
    "categoria": "informatica",
    "traduccion": "Solution",
    "definicion": "Respuesta o conjunto de acciones que resuelven un problema técnico o informático.",
    "ejemplo": "La solución propuesta permite corregir el error de conexión."
  },
  {
    "palabra": "Tarjeta madre",
    "categoria": "arquitectura",
    "traduccion": "Motherboard",
    "definicion": "Placa principal de una computadora que conecta y coordina todos los componentes del sistema.",
    "ejemplo": "La tarjeta madre incluye ranuras para la memoria RAM y el procesador."
  },
  {
    "palabra": "Teclado",
    "categoria": "arquitectura",
    "traduccion": "Keyboard",
    "definicion": "Dispositivo de entrada que permite escribir y controlar funciones mediante teclas.",
    "ejemplo": "El teclado mecánico ofrece mayor precisión al escribir código."
  },
  {
    "palabra": "Trabajo",
    "categoria": "informatica",
    "traduccion": "Work",
    "definicion": "Actividad realizada con herramientas digitales o sistemas informáticos para cumplir objetivos.",
    "ejemplo": "El trabajo remoto se facilita gracias a las plataformas colaborativas."
  },
  {
    "palabra": "Ultima",
    "categoria": "informatica",
    "traduccion": "Latest",
    "definicion": "Referencia a la versión más reciente de un software, archivo o actualización.",
    "ejemplo": "Descargá la última versión del navegador para mayor seguridad."
  },
  {
    "palabra": "Usando",
    "categoria": "informatica",
    "traduccion": "Using",
    "definicion": "Acción de aplicar o emplear herramientas, recursos o funciones en un entorno digital.",
    "ejemplo": "Estamos usando un editor de texto para escribir código."
  },
  {
    "palabra": "Usuario",
    "categoria": "informatica",
    "traduccion": "User",
    "definicion": "Persona que interactúa con un sistema informático o aplicación.",
    "ejemplo": "Cada usuario tiene un nombre y contraseña para acceder al sistema."
  },
  {
    "palabra": "Util",
    "categoria": "informatica",
    "traduccion": "Useful",
    "definicion": "Que cumple una función práctica o facilita una tarea en el ámbito digital.",
    "ejemplo": "Este programa es muy útil para organizar tus archivos."
  },
  {
    "palabra": "Ventana",
    "categoria": "informatica",
    "traduccion": "Window",
    "definicion": "Área visual en la interfaz gráfica que muestra contenido o permite interacción con una aplicación.",
    "ejemplo": "Abrí una nueva ventana para ver el documento sin cerrar el navegador."
  },
  {
    "palabra": "Camara web",
    "categoria": "arquitectura",
    "traduccion": "Webcam",
    "definicion": "Dispositivo de entrada que captura imágenes o video en tiempo real, generalmente conectado a una computadora.",
    "ejemplo": "La clase virtual se transmitió en vivo gracias a la webcam."
  },
  {
    "palabra": "WiFi",
    "categoria": "informatica",
    "traduccion": "Wi-Fi",
    "definicion": "Tecnología inalámbrica que permite la conexión a redes de datos sin cables físicos.",
    "ejemplo": "Conectate al Wi-Fi del instituto para acceder al diccionario técnico."
  },
  {
    "palabra": "Bus de datos",
    "categoria": "arquitectura",
    "traduccion": "Data Bus",
    "definicion": "Canal físico o lógico que transporta datos entre los componentes del sistema.",
    "ejemplo": "El bus de datos conecta la memoria con el procesador."
  },
  {
    "palabra": "Registros",
    "categoria": "arquitectura",
    "traduccion": "Registers",
    "definicion": "Pequeñas unidades de almacenamiento dentro del procesador que guardan datos temporales.",
    "ejemplo": "Los registros permiten realizar operaciones rápidas sin acceder a la memoria principal."
  },
  {
    "palabra": "Arquitectura Von Neumann",
    "categoria": "arquitectura",
    "traduccion": "Von Neumann Architecture",
    "definicion": "Modelo de diseño de computadoras donde datos e instrucciones comparten la misma memoria.",
    "ejemplo": "La mayoría de las computadoras modernas siguen la arquitectura Von Neumann."
  },
  {
    "palabra": "Ciclo de instrucción",
    "categoria": "arquitectura",
    "traduccion": "Instruction Cycle",
    "definicion": "Secuencia de pasos que realiza el procesador para ejecutar una instrucción.",
    "ejemplo": "El ciclo de instrucción incluye buscar, decodificar y ejecutar."
  },
  {
    "palabra": "ALU",
    "categoria": "arquitectura",
    "traduccion": "Arithmetic Logic Unit",
    "definicion": "Componente del procesador que realiza operaciones aritméticas y lógicas.",
    "ejemplo": "La ALU ejecuta sumas, restas y comparaciones dentro del CPU."
  },
  {
    "palabra": "BIOS",
    "categoria": "arquitectura",
    "traduccion": "Basic Input Output System",
    "definicion": "Programa básico que inicia el hardware y carga el sistema operativo.",
    "ejemplo": "El BIOS se ejecuta al encender la computadora y verifica los componentes."
  },
  {
    "palabra": "Interrupción",
    "categoria": "arquitectura",
    "traduccion": "Interrupt",
    "definicion": "Señal que altera el flujo normal de ejecución para atender eventos urgentes.",
    "ejemplo": "Una interrupción permite que el sistema responda rápidamente al teclado."
  },
  {
    "palabra": "Multiprocesador",
    "categoria": "arquitectura",
    "traduccion": "Multiprocessor",
    "definicion": "Sistema que utiliza más de un procesador para ejecutar tareas simultáneamente.",
    "ejemplo": "Los servidores modernos suelen tener arquitectura multiprocesador."
  },
  {
    "palabra": "Pipeline",
    "categoria": "informatica",
    "traduccion": "Pipeline",
    "definicion": "Técnica que permite ejecutar múltiples instrucciones en paralelo dentro del procesador.",
    "ejemplo": "El pipeline mejora el rendimiento al dividir las instrucciones en etapas."
  },
  {
    "palabra": "Reloj del sistema",
    "categoria": "arquitectura",
    "traduccion": "System Clock",
    "definicion": "Circuito que sincroniza las operaciones del procesador mediante pulsos regulares.",
    "ejemplo": "La velocidad del reloj del sistema se mide en gigahercios (GHz)."
  },
  {
    "palabra": "Memoria principal",
    "categoria": "arquitectura",
    "traduccion": "Main Memory",
    "definicion": "Área de almacenamiento donde se guardan datos e instrucciones en uso.",
    "ejemplo": "La memoria principal es esencial para ejecutar programas activos."
  },
  {
    "palabra": "Coprocesador",
    "categoria": "arquitectura",
    "traduccion": "Coprocessor",
    "definicion": "Unidad auxiliar que complementa al procesador principal en tareas específicas como cálculos matemáticos o gráficos.",
    "ejemplo": "El coprocesador gráfico mejora el rendimiento en videojuegos y diseño 3D."
  },
  {
    "palabra": "Decodificador de instrucciones",
    "categoria": "programacion",
    "traduccion": "Instruction Decoder",
    "definicion": "Componente que interpreta las instrucciones del programa y las traduce en señales para el procesador.",
    "ejemplo": "El decodificador de instrucciones transforma el código binario en acciones concretas."
  },
  {
    "palabra": "Memoria virtual",
    "categoria": "arquitectura",
    "traduccion": "Virtual Memory",
    "definicion": "Técnica que permite usar parte del almacenamiento como si fuera memoria RAM, ampliando la capacidad operativa.",
    "ejemplo": "La memoria virtual evita que el sistema se quede sin espacio para ejecutar programas."
  },
  {
    "palabra": "Topología de red",
    "categoria": "arquitectura",
    "traduccion": "Network Topology",
    "definicion": "Forma en que se organizan y conectan los dispositivos dentro de una red informática.",
    "ejemplo": "La topología en estrella conecta todos los dispositivos a un nodo central."
  },
  {
    "palabra": "Unidad de punto flotante",
    "categoria": "arquitectura",
    "traduccion": "Floating Point Unit",
    "definicion": "Parte del procesador especializada en cálculos con números decimales o reales.",
    "ejemplo": "La unidad de punto flotante es esencial para simulaciones científicas."
  },
  {
    "palabra": "Controlador de memoria",
    "categoria": "arquitectura",
    "traduccion": "Memory Controller",
    "definicion": "Circuito que gestiona el acceso a la memoria principal y coordina la lectura y escritura de datos.",
    "ejemplo": "El controlador de memoria optimiza el flujo de datos entre el procesador y la RAM."
  },
  {
    "palabra": "Unidad lógica",
    "categoria": "arquitectura",
    "traduccion": "Logic Unit",
    "definicion": "Parte del procesador que realiza operaciones lógicas como comparaciones y decisiones.",
    "ejemplo": "La unidad lógica determina si una condición es verdadera o falsa."
  },
  {
    "palabra": "Monitor",
    "categoria": "arquitectura",
    "traduccion": "Monitor",
    "definicion": "Dispositivo de salida que muestra información visual al usuario.",
    "ejemplo": "El monitor permite ver el escritorio y las aplicaciones abiertas."
  },
  {
    "palabra": "Impresora",
    "categoria": "arquitectura",
    "traduccion": "Printer",
    "definicion": "Dispositivo de salida que transfiere información digital al papel.",
    "ejemplo": "La impresora se usa para obtener copias físicas de documentos."
  },
  {
    "palabra": "Escáner",
    "categoria": "arquitectura",
    "traduccion": "Scanner",
    "definicion": "Dispositivo de entrada que digitaliza documentos físicos.",
    "ejemplo": "El escáner convierte una hoja impresa en una imagen digital."
  },
  {
    "palabra": "Micrófono",
    "categoria": "arquitectura",
    "traduccion": "Microphone",
    "definicion": "Dispositivo de entrada que captura sonido para su procesamiento digital.",
    "ejemplo": "El micrófono permite grabar voz o comunicarse en línea."
  },
  {
    "palabra": "Altavoces",
    "categoria": "arquitectura",
    "traduccion": "Speakers",
    "definicion": "Dispositivo de salida que reproduce sonido desde la computadora.",
    "ejemplo": "Los altavoces permiten escuchar música o sonidos del sistema."
  },
  {
    "palabra": "Unidad flash",
    "categoria": "arquitectura",
    "traduccion": "Flash Drive",
    "definicion": "Dispositivo de almacenamiento portátil que utiliza memoria flash.",
    "ejemplo": "La unidad flash se conecta por USB y permite transportar archivos."
  },
  {
    "palabra": "Disco duro externo",
    "categoria": "arquitectura",
    "traduccion": "External Hard Drive",
    "definicion": "Dispositivo de almacenamiento que se conecta externamente para guardar grandes cantidades de datos.",
    "ejemplo": "El disco duro externo se usa para respaldar información importante."
  },
  {
    "palabra": "Procesador",
    "categoria": "arquitectura",
    "traduccion": "Processor",
    "definicion": "Unidad central que ejecuta instrucciones y coordina las operaciones del sistema.",
    "ejemplo": "El procesador determina la velocidad de ejecución de los programas."
  },
  {
    "palabra": "Memoria RAM",
    "categoria": "arquitectura",
    "traduccion": "RAM Memory",
    "definicion": "Memoria volátil que almacena datos temporales mientras el sistema está en funcionamiento.",
    "ejemplo": "Cuanta más memoria RAM tenga tu computadora, mejor será su rendimiento."
  },
  {
    "palabra": "Fuente de poder",
    "categoria": "arquitectura",
    "traduccion": "Power Supply",
    "definicion": "Componente que convierte la energía eléctrica en voltajes adecuados para los demás dispositivos.",
    "ejemplo": "La fuente de poder alimenta la tarjeta madre y los periféricos."
  },
  {
    "palabra": "Tarjeta gráfica",
    "categoria": "arquitectura",
    "traduccion": "Graphics Card",
    "definicion": "Unidad que procesa imágenes y gráficos para mostrarlos en pantalla.",
    "ejemplo": "La tarjeta gráfica mejora el rendimiento en videojuegos y diseño visual."
  },
  {
    "palabra": "Sistema de refrigeración",
    "categoria": "arquitectura",
    "traduccion": "Cooling System",
    "definicion": "Conjunto de ventiladores o disipadores que regulan la temperatura interna del equipo.",
    "ejemplo": "El sistema de refrigeración evita el sobrecalentamiento del procesador."
  },
  {
    "palabra": "Product Owner",
    "categoria": "programacion",
    "traduccion": "Responsable del producto",
    "definicion": "Rol que define y prioriza el backlog del producto, asegurando que el equipo trabaje en lo más valioso.",
    "ejemplo": "El Product Owner revisó las historias de usuario antes del sprint."
  },
  {
    "palabra": "Scrum Master",
    "categoria": "programacion",
    "traduccion": "Facilitador ágil",
    "definicion": "Persona que guía el proceso Scrum, elimina impedimentos y promueve la mejora continua.",
    "ejemplo": "El Scrum Master facilitó la reunión diaria y ayudó a resolver bloqueos técnicos."
  },
  {
    "palabra": "Team Lead",
    "categoria": "programacion",
    "traduccion": "Líder técnico",
    "definicion": "Responsable de coordinar al equipo de desarrollo y guiar las decisiones técnicas del proyecto.",
    "ejemplo": "El Team Lead propuso una nueva arquitectura para mejorar el rendimiento."
  },
  {
    "palabra": "Desarrolladores",
    "categoria": "programacion",
    "traduccion": "Developers",
    "definicion": "Integrantes del equipo que codifican, prueban y mantienen el software.",
    "ejemplo": "Los desarrolladores completaron las tareas del sprint y publicaron una nueva versión."
  },
  {
    "palabra": "UX Designer",
    "categoria": "programacion",
    "traduccion": "Diseñador de experiencia de usuario",
    "definicion": "Profesional que diseña la interacción entre el usuario y el sistema, buscando claridad, fluidez y empatía en cada paso.",
    "ejemplo": "El UX Designer rediseñó el flujo de navegación para hacerlo más intuitivo."
  },
  {
    "palabra": "DevOps",
    "categoria": "programacion",
    "traduccion": "Integrador de desarrollo y operaciones",
    "definicion": "Rol que automatiza procesos, mantiene la infraestructura y facilita la entrega continua de software.",
    "ejemplo": "El equipo de DevOps configuró el pipeline para desplegar cada versión sin intervención manual."
  },
  {
    "palabra": "QA Tester",
    "categoria": "programacion",
    "traduccion": "Verificador de calidad",
    "definicion": "Persona encargada de probar el software, detectar errores y asegurar que cumpla con los criterios definidos.",
    "ejemplo": "El QA Tester encontró un bug en el formulario de registro antes del lanzamiento."
  },
  {
    "palabra": "Arquitecto de Software",
    "categoria": "programacion",
    "traduccion": "Software Architect",
    "definicion": "Responsable de definir la estructura técnica del sistema, sus componentes y cómo se relacionan.",
    "ejemplo": "El arquitecto de software propuso una arquitectura basada en microservicios para escalar el proyecto."
  },
  {
    "palabra": "Analista Funcional",
    "categoria": "programacion",
    "traduccion": "Functional Analyst",
    "definicion": "Intermediario entre el cliente y el equipo técnico, que traduce requerimientos en especificaciones claras.",
    "ejemplo": "El analista funcional documentó los procesos del usuario para que el equipo pudiera modelarlos."
  },
  {
    "palabra": "Archivo de seguimiento",
    "traduccion": "Cookie",
    "categoria": "informatica",
    "definicion": "Archivo pequeño que un sitio web guarda en el navegador del usuario para recordar información entre sesiones.",
    "ejemplo": "El sitio usó una cookie para recordar tu idioma preferido."
  },
  {
    "palabra": "Imagen de portada",
    "traduccion": "Cover",
    "categoria": "informatica",
    "definicion": "Imagen o diseño que se utiliza como portada visual en una interfaz digital, como un perfil o una presentación.",
    "ejemplo": "Cambió la cover de su perfil en la red social."
  },
  {
    "palabra": "Transferencia de archivos",
    "traduccion": "File transfer",
    "categoria": "informatica",
    "definicion": "Proceso de mover o copiar archivos de un dispositivo o sistema a otro, generalmente a través de una red.",
    "ejemplo": "Realizó una transferencia de archivos desde su computadora al servidor remoto."
  },
  {
    "palabra": "Hacker",
    "traduccion": "hacker",
    "categoria": "informatica",
    "definicion": "Persona con conocimientos avanzados en informática que puede modificar sistemas, a veces con fines éticos y otras veces con intenciones maliciosas.",
    "ejemplo": "Un hacker ético ayudó a detectar vulnerabilidades en el sistema."
  },
  {
    "palabra": "Página de inicio",
    "traduccion": "Home Page",
    "categoria": "informatica",
    "definicion": "Primera página que se muestra al ingresar a un sitio web, que suele contener enlaces a las secciones principales.",
    "ejemplo": "La página de inicio del diccionario muestra las categorías disponibles."
  },
  {
    "palabra": "Bandeja de entrada",
    "traduccion": "Inbox",
    "categoria": "informatica",
    "definicion": "Sección de una aplicación de correo electrónico donde se reciben los mensajes nuevos.",
    "ejemplo": "Revisó su inbox y encontró un correo del instituto."
  },
  {
    "palabra": "Vista previa",
    "traduccion": "Preview",
    "categoria": "informatica",
    "definicion": "Función que permite ver cómo se verá un archivo, documento o contenido antes de ser publicado o guardado.",
    "ejemplo": "Antes de imprimir el informe, revisó la vista previa para corregir errores."
  },
  {
    "palabra": "busqueda",
    "traduccion": "Search",
    "categoria": "informatica",
    "definicion": "Acción de localizar información dentro de un sistema, sitio web o base de datos mediante palabras clave.",
    "ejemplo": "Usó la función de búsqueda para encontrar el término 'algoritmo'."
  },
  {
    "palabra": "Configuración",
    "traduccion": "Setup",
    "categoria": "informatica",
    "definicion": "Proceso de instalación y ajuste inicial de un sistema, programa o dispositivo para que funcione correctamente.",
    "ejemplo": "Durante el setup del software, eligió el idioma y la carpeta de destino."
  },
  {
    "palabra": "Archivo adjunto",
    "traduccion": "Attachment",
    "categoria": "informatica",
    "definicion": "Archivo que se envía junto a un correo electrónico o mensaje digital.",
    "ejemplo": "El profesor envió el programa de la materia como archivo adjunto."
  },
  {
    "palabra": "Entorno",
    "traduccion": "Environment",
    "categoria": "informatica",
    "definicion": "Conjunto de condiciones y herramientas que rodean el desarrollo o ejecución de un software, como el sistema operativo, librerías y configuraciones.",
    "ejemplo": "Configuró el entorno de desarrollo para trabajar con Python y HTML."
  },
  {
    "palabra": "memoria USB",
    "traduccion": "Pendrive",
    "categoria": "arquitectura",
    "definicion": "Dispositivo portátil de almacenamiento que se conecta a través del puerto USB y permite guardar, transferir y transportar archivos.",
    "ejemplo": "Guardó el trabajo práctico en su pendrive para llevarlo al instituto."
  },
  {
    "palabra": "Código binario",
    "traduccion": "Binary code",
    "categoria": "informatica",
    "definicion": "Sistema de codificación que utiliza solo dos dígitos, 0 y 1, para representar datos e instrucciones en computadoras.",
    "ejemplo": "El procesador interpreta las instrucciones en código binario para ejecutar tareas."
  },
  {
    "palabra": "Licencia de software",
    "traduccion": "Software license",
    "categoria": "informatica",
    "definicion": "Permiso legal que establece cómo puede usarse, distribuirse o modificarse un programa informático.",
    "ejemplo": "El editor eligió una licencia de software libre para su aplicación educativa."
  },
  {
    "palabra": "Alojamiento web",
    "traduccion": "Hosting",
    "categoria": "informatica",
    "definicion": "Servicio que permite almacenar y publicar sitios web en servidores accesibles desde internet.",
    "ejemplo": "Contrataron un servicio de hosting para subir el diccionario técnico al sitio institucional."
  },
  {
    "palabra": "Página web",
    "traduccion": "Web page",
    "categoria": "informatica",
    "definicion": "Documento digital que forma parte de un sitio web y que puede contener texto, imágenes, enlaces y otros elementos interactivos.",
    "ejemplo": "La página web del glosario incluye categorías como programación e informática."
  },
  {
    "palabra": "Contraseña",
    "traduccion": "Password",
    "categoria": "informatica",
    "definicion": "Cadena de caracteres utilizada para verificar la identidad de un usuario y proteger el acceso a sistemas o servicios.",
    "ejemplo": "Ingresó su contraseña para acceder al correo institucional."
  },
  {
    "palabra": "Ancho de banda",
    "traduccion": "Ancho de banda",
    "categoria": "informatica",
    "definicion": "Cantidad de datos que puede transmitirse por una red en un período determinado, generalmente medido en megabits por segundo (Mbps).",
    "ejemplo": "El video tardó en cargar por el bajo ancho de banda disponible."
  },
  {
    "palabra": "Spam",
    "traduccion": "Correo no deseado",
    "categoria": "informatica",
    "definicion": "Mensajes electrónicos no solicitados, generalmente de tipo publicitario, que se envían masivamente.",
    "ejemplo": "El filtro de spam bloqueó los correos sospechosos."
  },
  {
    "palabra": "Reiniciar",
    "traduccion": "Reboot",
    "categoria": "informatica",
    "definicion": "Acción de apagar y volver a encender un sistema o dispositivo para restaurar su funcionamiento.",
    "ejemplo": "Tuvo que reiniciar la computadora para aplicar las actualizaciones."
  },
  {
    "palabra": "Inicio del sistema",
    "traduccion": "Boot Up",
    "categoria": "informatica",
    "definicion": "Proceso mediante el cual una computadora carga el sistema operativo y se prepara para ser utilizada.",
    "ejemplo": "Durante el boot up, el sistema mostró el logotipo del instituto."
  },
  {
    "palabra": "captura de pantalla",
    "traduccion": "Screenshot",
    "categoria": "informatica",
    "definicion": "Imagen que muestra el contenido visible en la pantalla de un dispositivo en un momento determinado.",
    "ejemplo": "Tomó una captura de pantalla del error para enviárselo al profesor."
  },
  {
    "palabra": "componente interactivo",
    "traduccion": "Widget",
    "categoria": "informatica",
    "definicion": "Elemento visual que permite mostrar información o realizar acciones rápidas en una interfaz, como reloj, clima o accesos directos.",
    "ejemplo": "Agregó un widget de calendario en la pantalla principal de su celular."
  },
  {
    "palabra": "Pantalla de bloqueo",
    "traduccion": "Lock screen",
    "categoria": "informatica",
    "definicion": "Interfaz que aparece cuando un dispositivo está bloqueado, mostrando la hora, notificaciones y opciones de desbloqueo.",
    "ejemplo": "Personalizó la pantalla de bloqueo con una imagen del instituto."
  },
  {
    "palabra": "Tarjeta SIM",
    "traduccion": "SIM card",
    "categoria": "informatica",
    "definicion": "Chip que se inserta en dispositivos móviles para conectarse a redes celulares y almacenar información del usuario.",
    "ejemplo": "Tuvo que cambiar la tarjeta SIM para activar el nuevo teléfono."
  },
  {
    "palabra": "Cortar y pegar",
    "traduccion": "Cut and paste",
    "categoria": "informatica",
    "definicion": "Acción de mover contenido de un lugar a otro, eliminándolo de su origen y colocándolo en un nuevo destino.",
    "ejemplo": "Cortó y pegó el párrafo en otra sección del documento."
  },
  {
    "palabra": "Arrastrar y soltar",
    "traduccion": "Drag and drop",
    "categoria": "informatica",
    "definicion": "Interacción que permite mover elementos en una interfaz gráfica arrastrándolos con el cursor y soltándolos en otra ubicación.",
    "ejemplo": "Organizó los archivos usando la función de arrastrar y soltar."
  },
  {
    "palabra": "Comprimir",
    "traduccion": "Zip",
    "categoria": "informatica",
    "definicion": "Acción de reducir el tamaño de uno o varios archivos agrupándolos en un solo archivo comprimido, generalmente con extensión .zip.",
    "ejemplo": "Comprimió las imágenes en un archivo zip para enviarlas por correo."
  },
  {
    "palabra": "Guardar como",
    "traduccion": "Save as",
    "categoria": "informatica",
    "definicion": "Opción que permite guardar un archivo con un nuevo nombre, ubicación o formato.",
    "ejemplo": "Usó 'guardar como' para exportar el documento en PDF."
  },
  {
    "palabra": "Párrafo",
    "traduccion": "Paragraph",
    "categoria": "informatica",
    "definicion": "Bloque de texto separado por saltos de línea, que puede tener formato propio en un procesador de texto.",
    "ejemplo": "Alineó el párrafo al centro para destacarlo en la presentación."
  },
  {
    "palabra": "Salto de página",
    "traduccion": "Page break",
    "categoria": "informatica",
    "definicion": "Elemento que indica el final de una página y el comienzo de otra en un documento digital.",
    "ejemplo": "Insertó un salto de página antes del nuevo capítulo."
  },
  {
    "palabra": "Tabla de contenido",
    "traduccion": "Table of contents",
    "categoria": "informatica",
    "definicion": "Lista organizada de secciones o títulos de un documento, que permite navegar fácilmente por su estructura.",
    "ejemplo": "La tabla de contenido incluía enlaces a cada unidad del manual."
  },
  {
    "palabra": "Insertar",
    "traduccion": "Insert",
    "categoria": "informatica",
    "definicion": "Acción de agregar un elemento (imagen, tabla, enlace, etc.) dentro de un documento o archivo digital.",
    "ejemplo": "Insertó una imagen en el informe para ilustrar el concepto."
  },
  {
    "palabra": "Diccionario",
    "traduccion": "dictionary",
    "categoria": "programacion",
    "definicion": "Estructura de datos que almacena pares clave-valor, similar a un objeto JSON.",
    "ejemplo": "usuario = { 'nombre': 'Ana', 'edad': 25 }"
  },
  {
    "palabra": "Lista",
    "traduccion": "list",
    "categoria": "programacion",
    "definicion": "Colección ordenada y mutable de elementos en Python.",
    "ejemplo": "numeros = [1, 2, 3, 4]"
  },
  {
    "palabra": "Tupla",
    "traduccion": "tuple",
    "categoria": "programacion",
    "definicion": "Colección ordenada e inmutable de elementos en Python.",
    "ejemplo": "coordenadas = (10, 20)"
  },
  {
    "palabra": "Módulo",
    "traduccion": "module",
    "categoria": "programacion",
    "definicion": "Archivo de Python que contiene funciones, clases o variables que pueden importarse en otros programas.",
    "ejemplo": "import math"
  },
  {
    "palabra": "Paquete",
    "traduccion": "package",
    "categoria": "programacion",
    "definicion": "Colección de módulos organizados en carpetas con un archivo __init__.py.",
    "ejemplo": "import numpy"
  },
  {
    "palabra": "Excepción",
    "traduccion": "exception",
    "categoria": "programacion",
    "definicion": "Error detectado durante la ejecución que puede manejarse con try/except.",
    "ejemplo": "try: x = 1/0 except ZeroDivisionError: print('Error')"
  },
  {
    "palabra": "Heurística",
    "traduccion": "Heuristic",
    "definicion": "Método para resolver problemas mediante aproximaciones prácticas.",
    "ejemplo": "Usamos una heurística para encontrar la mejor ruta.",
    "categoria": "Informática"
  },
  {
    "palabra": "Compilar",
    "traduccion": "Compile",
    "definicion": "Transformar código fuente en ejecutable.",
    "ejemplo": "Compilamos el programa antes de ejecutarlo.",
    "categoria": "Programación"
  },
  {
    "palabra": "Símbolo",
    "traduccion": "Symbol",
    "definicion": "Elemento que representa una idea, emoción o concepto más allá de su forma.",
    "ejemplo": "El verde inglés es símbolo de lo institucional en nuestro glosario.",
    "categoria": "Poética técnica"
  },
  {
    "palabra": "Cloud Computing",
    "traduccion": "Cloud Computing",
    "categoria": "informatica",
    "definicion": "Uso de servidores remotos para almacenar, gestionar y procesar datos a través de internet.",
    "ejemplo": "Usamos Cloud Computing para escalar nuestra aplicación sin servidores físicos."
  },
  {
    "palabra": "Kubernetes",
    "traduccion": "Kubernetes",
    "categoria": "informatica",
    "definicion": "Sistema de código abierto para automatizar la implementación, el escalado y la gestión de aplicaciones en contenedores.",
    "ejemplo": "El equipo usa Kubernetes para orquestar los microservicios de la plataforma."
  },
  {
    "palabra": "Docker",
    "traduccion": "Docker",
    "categoria": "informatica",
    "definicion": "Herramienta que permite empacar, distribuir y ejecutar aplicaciones en contenedores aislados.",
    "ejemplo": "Docker asegura que la aplicación se ejecute igual en cualquier entorno."
  },
  {
    "palabra": "Microservicios",
    "traduccion": "Microservices",
    "categoria": "programacion",
    "definicion": "Arquitectura de software que construye una aplicación como un conjunto de pequeños servicios independientes.",
    "ejemplo": "Cambiamos a una arquitectura de microservicios para facilitar el despliegue continuo."
  },
  {
    "palabra": "Blockchain",
    "traduccion": "Blockchain",
    "categoria": "informatica",
    "definicion": "Libro de contabilidad digital descentralizado y seguro que registra transacciones en múltiples computadoras.",
    "ejemplo": "La tecnología blockchain garantiza la inmutabilidad de los registros de transacciones."
  },
  {
    "palabra": "JWT",
    "traduccion": "JSON Web Token",
    "categoria": "programacion",
    "definicion": "Estándar abierto para transmitir información de forma segura entre partes como un objeto JSON.",
    "ejemplo": "Usamos JWT para autenticar a los usuarios en nuestra API REST."
  },
  {
    "palabra": "API REST",
    "traduccion": "REST API",
    "categoria": "programacion",
    "definicion": "Interfaz de programación de aplicaciones que utiliza peticiones HTTP para acceder y manipular datos.",
    "ejemplo": "La API REST permite que la app móvil se comunique con el servidor central."
  },
  {
    "palabra": "WebSockets",
    "traduccion": "WebSockets",
    "categoria": "programacion",
    "definicion": "Protocolo de comunicación que permite el intercambio de datos bidireccional y en tiempo real.",
    "ejemplo": "Usamos WebSockets para implementar el sistema de chat en vivo."
  },
  {
    "palabra": "CI/CD",
    "traduccion": "Continuous Integration / Continuous Deployment",
    "categoria": "programacion",
    "definicion": "Práctica de automatizar la integración de cambios de código y su despliegue en producción.",
    "ejemplo": "Nuestro pipeline de CI/CD sube el código a producción automáticamente tras pasar los tests."
  },
  {
    "palabra": "DevOps",
    "traduccion": "DevOps",
    "categoria": "informatica",
    "definicion": "Combinación de filosofías, prácticas y herramientas que aumentan la capacidad de una organización para entregar aplicaciones rápidamente.",
    "ejemplo": "El equipo de DevOps optimizó la infraestructura para soportar más tráfico."
  },
  {
    "palabra": "TypeScript",
    "traduccion": "TypeScript",
    "categoria": "programacion",
    "definicion": "Superconjunto de JavaScript que añade tipos estáticos y herramientas avanzadas al lenguaje.",
    "ejemplo": "TypeScript nos ayuda a detectar errores en tiempo de compilación."
  },
  {
    "palabra": "GraphQL",
    "traduccion": "GraphQL",
    "categoria": "programacion",
    "definicion": "Lenguaje de consulta para APIs que permite a los clientes solicitar exactamente los datos que necesitan.",
    "ejemplo": "Con GraphQL, evitamos el sobre-envío de datos en nuestras peticiones móviles."
  },
  {
    "palabra": "Serverless",
    "traduccion": "Serverless",
    "categoria": "informatica",
    "definicion": "Modelo de computación en la nube donde el proveedor gestiona la asignación de recursos de máquina automáticamente.",
    "ejemplo": "Nuestras funciones Lambda se ejecutan en un entorno Serverless."
  },
  {
    "palabra": "Machine Learning",
    "traduccion": "Machine Learning",
    "categoria": "informatica",
    "definicion": "Rama de la inteligencia artificial que permite que los sistemas aprendan y mejoren a partir de la experiencia.",
    "ejemplo": "El algoritmo de recomendación usa Machine Learning para predecir tus gustos."
  },
  {
    "palabra": "Inteligencia Artificial",
    "traduccion": "Artificial Intelligence",
    "categoria": "informatica",
    "definicion": "Simulación de procesos de inteligencia humana por parte de máquinas, especialmente sistemas informáticos.",
    "ejemplo": "La Inteligencia Artificial está transformando la forma en que escribimos código."
  },
  {
    "palabra": "Edge Computing",
    "traduccion": "Edge Computing",
    "categoria": "informatica",
    "definicion": "Procesamiento de datos que ocurre cerca de la fuente de los mismos, en lugar de en una nube centralizada.",
    "ejemplo": "El Edge Computing reduce la latencia en aplicaciones críticas de IoT."
  },
  {
    "palabra": "Big Data",
    "traduccion": "Big Data",
    "categoria": "informatica",
    "definicion": "Conjuntos de datos extremadamente grandes y complejos que requieren herramientas especializadas para su análisis.",
    "ejemplo": "Analizamos el Big Data del tráfico para optimizar las rutas de transporte."
  },
  {
    "palabra": "Diseño Responsivo",
    "traduccion": "Responsive Design",
    "categoria": "informatica",
    "definicion": "Enfoque de diseño web que hace que las páginas se visualicen correctamente en todos los dispositivos y tamaños de pantalla.",
    "ejemplo": "El diseño responsivo asegura que el glosario se vea bien tanto en PC como en móvil."
  },
  {
    "palabra": "Frontend",
    "traduccion": "Frontend",
    "categoria": "programacion",
    "definicion": "Parte de una aplicación o sitio web con la que el usuario interactúa directamente.",
    "ejemplo": "El desarrollador Frontend mejoró la interfaz usando React."
  },
  {
    "palabra": "Backend",
    "traduccion": "Backend",
    "categoria": "programacion",
    "definicion": "Parte de una aplicación encargada de la lógica del servidor, base de datos y autenticación.",
    "ejemplo": "El Backend gestiona las peticiones de los usuarios y devuelve los resultados."
  },
  {
    "palabra": "Full Stack",
    "traduccion": "Full Stack",
    "categoria": "programacion",
    "definicion": "Desarrollador capaz de trabajar tanto en el Frontend como en el Backend de una aplicación.",
    "ejemplo": "Como desarrollador Full Stack, puedo crear la interfaz y también la lógica del servidor."
  }
]